SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG26/Include/efr32bg26_pcnt.h
/* Bit fields for PCNT OVSCTRL */
#define _PCNT_OVSCTRL_RESETVALUE                0x00000000UL                            /**< Default value for PCNT_OVSCTRL              */
#define _PCNT_OVSCTRL_MASK                      0x000010FFUL                            /**< Mask for PCNT_OVSCTRL                       */
#define _PCNT_OVSCTRL_FILTLEN_SHIFT             0                                       /**< Shift value for PCNT_FILTLEN                */
#define _PCNT_OVSCTRL_FILTLEN_MASK              0xFFUL                                  /**< Bit mask for PCNT_FILTLEN                   */
#define _PCNT_OVSCTRL_FILTLEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for PCNT_OVSCTRL               */
#define PCNT_OVSCTRL_FILTLEN_DEFAULT            (_PCNT_OVSCTRL_FILTLEN_DEFAULT << 0)    /**< Shifted mode DEFAULT for PCNT_OVSCTRL       */
#define PCNT_OVSCTRL_FLUTTERRM                  (0x1UL << 12)                           /**< Flutter Remove                              */
#define _PCNT_OVSCTRL_FLUTTERRM_SHIFT           12                                      /**< Shift value for PCNT_FLUTTERRM              */
#define _PCNT_OVSCTRL_FLUTTERRM_MASK            0x1000UL                                /**< Bit mask for PCNT_FLUTTERRM                 */
#define _PCNT_OVSCTRL_FLUTTERRM_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for PCNT_OVSCTRL               */
#define PCNT_OVSCTRL_FLUTTERRM_DEFAULT          (_PCNT_OVSCTRL_FLUTTERRM_DEFAULT << 12) /**< Shifted mode DEFAULT for PCNT_OVSCTRL       */

/* Bit fields for PCNT SYNCBUSY */
#define _PCNT_SYNCBUSY_RESETVALUE               0x00000000UL                            /**< Default value for PCNT_SYNCBUSY             */
#define _PCNT_SYNCBUSY_MASK                     0x0000001FUL                            /**< Mask for PCNT_SYNCBUSY                      */
#define PCNT_SYNCBUSY_CTRL                      (0x1UL << 0)                            /**< CTRL Register Busy                          */
#define _PCNT_SYNCBUSY_CTRL_SHIFT               0                                       /**< Shift value for PCNT_CTRL                   */
#define _PCNT_SYNCBUSY_CTRL_MASK                0x1UL                                   /**< Bit mask for PCNT_CTRL                      */
#define _PCNT_SYNCBUSY_CTRL_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for PCNT_SYNCBUSY              */
#define PCNT_SYNCBUSY_CTRL_DEFAULT              (_PCNT_SYNCBUSY_CTRL_DEFAULT << 0)      /**< Shifted mode DEFAULT for PCNT_SYNCBUSY      */
#define PCNT_SYNCBUSY_CMD                       (0x1UL << 1)                            /**< CMD Register Busy                           */
#define _PCNT_SYNCBUSY_CMD_SHIFT                1                                       /**< Shift value for PCNT_CMD                    */
#define _PCNT_SYNCBUSY_CMD_MASK                 0x2UL                                   /**< Bit mask for PCNT_CMD                       */
#define _PCNT_SYNCBUSY_CMD_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for PCNT_SYNCBUSY              */
#define PCNT_SYNCBUSY_CMD_DEFAULT               (_PCNT_SYNCBUSY_CMD_DEFAULT << 1)       /**< Shifted mode DEFAULT for PCNT_SYNCBUSY      */
#define PCNT_SYNCBUSY_TOP                       (0x1UL << 2)                            /**< TOP Register Busy                           */
#define _PCNT_SYNCBUSY_TOP_SHIFT                2                                       /**< Shift value for PCNT_TOP                    */
#define _PCNT_SYNCBUSY_TOP_MASK                 0x4UL                                   /**< Bit mask for PCNT_TOP                       */
#define _PCNT_SYNCBUSY_TOP_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for PCNT_SYNCBUSY              */
#define PCNT_SYNCBUSY_TOP_DEFAULT               (_PCNT_SYNCBUSY_TOP_DEFAULT << 2)       /**< Shifted mode DEFAULT for PCNT_SYNCBUSY      */
#define PCNT_SYNCBUSY_TOPB                      (0x1UL << 3)                            /**< TOPB Register Busy                          */
#define _PCNT_SYNCBUSY_TOPB_SHIFT               3                                       /**< Shift value for PCNT_TOPB                   */
#define _PCNT_SYNCBUSY_TOPB_MASK                0x8UL                                   /**< Bit mask for PCNT_TOPB                      */
#define _PCNT_SYNCBUSY_TOPB_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for PCNT_SYNCBUSY              */
#define PCNT_SYNCBUSY_TOPB_DEFAULT              (_PCNT_SYNCBUSY_TOPB_DEFAULT << 3)      /**< Shifted mode DEFAULT for PCNT_SYNCBUSY      */
#define PCNT_SYNCBUSY_OVSCTRL                   (0x1UL << 4)                            /**< OVSCTRL Register Busy                       */
#define _PCNT_SYNCBUSY_OVSCTRL_SHIFT            4                                       /**< Shift value for PCNT_OVSCTRL                */
#define _PCNT_SYNCBUSY_OVSCTRL_MASK             0x10UL                                  /**< Bit mask for PCNT_OVSCTRL                   */
#define _PCNT_SYNCBUSY_OVSCTRL_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for PCNT_SYNCBUSY              */
#define PCNT_SYNCBUSY_OVSCTRL_DEFAULT           (_PCNT_SYNCBUSY_OVSCTRL_DEFAULT << 4)   /**< Shifted mode DEFAULT for PCNT_SYNCBUSY      */

/* Bit fields for PCNT LOCK */
#define _PCNT_LOCK_RESETVALUE                   0x00000000UL                            /**< Default value for PCNT_LOCK                 */
#define _PCNT_LOCK_MASK                         0x0000FFFFUL                            /**< Mask for PCNT_LOCK                          */
#define _PCNT_LOCK_PCNTLOCKKEY_SHIFT            0                                       /**< Shift value for PCNT_PCNTLOCKKEY            */
#define _PCNT_LOCK_PCNTLOCKKEY_MASK             0xFFFFUL                                /**< Bit mask for PCNT_PCNTLOCKKEY               */
#define _PCNT_LOCK_PCNTLOCKKEY_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for PCNT_LOCK                  */
#define _PCNT_LOCK_PCNTLOCKKEY_UNLOCK           0x0000A7E0UL                            /**< Mode UNLOCK for PCNT_LOCK                   */
#define PCNT_LOCK_PCNTLOCKKEY_DEFAULT           (_PCNT_LOCK_PCNTLOCKKEY_DEFAULT << 0)   /**< Shifted mode DEFAULT for PCNT_LOCK          */
#define PCNT_LOCK_PCNTLOCKKEY_UNLOCK            (_PCNT_LOCK_PCNTLOCKKEY_UNLOCK << 0)    /**< Shifted mode UNLOCK for PCNT_LOCK           */

/** @} End of group EFR32BG26_PCNT_BitFields */
/** @} End of group EFR32BG26_PCNT */
/** @} End of group Parts */

#endif // EFR32BG26_PCNT_H
